/* Имя оператора по умолчанию, если не подгрузилась информация */
"agent_name_default" = "Operador";

/* Надпись к сообщениям клиента */
"agent_name_you" = "Você";

"Agent.DisplayName.Deleted" = "Operador excluído";

/* Normally user iOS device doesn't return "Restricted" camera access status. But for test purposes we've added an alert with this string message anyway. */
"Camera.Access.Restricted" = "Acesso à câmera negado";

"Camera.Access.Suggestion" = "Precisamos desta permissão para que você consiga tirar e compartilhar fotos";

/* Alert with this message displays when you try to take a photo from camera on iOS simulator or when real device experiencing some technical issues. */
"Camera.Access.Unavailable" = "A câmera não está disponível";

"chat_input.status.contact_info" = "Preencha o formulário de contato acima";

/* Подзаголовок окна чата по умолчанию */
"chat_subtitle_placeholder" = "Inicie um chat conosco, 24/7!";

/* Системное сообщение в ленте чата, говорящее о том, что произошел разрыв соединения  с сервером. */
"chat_system_disconnected" = "Código de erro de rede: %d , mensagem de erro: %s";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент несколько агентов набирают сообщение. */
"chat_system_few_agents_typing" = "%s, %s e +%d estão digitando...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент один агент набирает сообщение. */
"chat_system_one_agent_typing" = "%s está digitando...";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент два агента набирают сообщение. */
"chat_system_two_agents_typing" = "%s e %s estão digitando...";

/* Заголовок окна чата по умолчанию */
"chat_title_placeholder" = "Reportar um problema";

"chat.state_unavailable.discription" = "O chat ao vivo está temporariamente indisponível no momento. Por favor, tente novamente mais tarde.";

"chat.state_unavailable.title" = "O bate-papo está temporariamente indisponível";

"chat.system.contact_form.introduce_in_chat" = "Por favor, apresente-se no chat";

"chat.system.contact_form.must_fill" = "Por favor, insira seus dados de contato para enviar esta mensagem";

"chat.system.contact_form.status_sent" = "Sua mensagem está sendo enviada para a nossa equipe. Entraremos em contato em breve. Fique à vontade para deixar mais mensagens abaixo caso deseje completar sua mensagem.";

"Chat.System.Media.Preparing" = "Preparando o arquivo...";

"Chat.System.Media.Uploading" = "Enviando arquivo...";

"Chat.System.NewMessages" = "Novas mensagens";

"Client.Title" = "Cliente #%d";

/* Общая строка "Отмена" */
"common_cancel" = "Cancelar";

"common_close" = "Fechar";

"common_done" = "Concluído";

/* Универсальное сообщение о неизвестной ошибке. */
"common_unknown_error" = "Erro desconhecido";

"Common.Open" = "Abrir";

"common.send" = "Enviar";

/* Состояние подключения к сервису */
"connection_state_connecting" = "Conectando...";

/* Состояние отсутствия подключения */
"connection_state_disconnected" = "Não há conexão, tentar novamente em %d";

/* Кнопка для повторного подключения к сервису, не дожидаясь таймаута  */
"connection_state_retry" = "Conectar agora";

"contact_form.email.placeholder" = "Seu email";

"contact_form.name.placeholder" = "Nome";

"contact_form.phone.placeholder" = "Telefone";

"contact_form.status.sent" = "Obrigado!";

/* Статус загрузки - ошибка */
"download_status_error" = "Erro";

/* Статус загрузки - загрузка */
"download_status_loading" = "Carregando...";

/* Ошибка загрузки файла, если ссылка устарела. */
"file_download_expired" = "O link expirou";

/* Message letting user know that file is unavailable for download. */
"file_download_unavailable" = "Arquivo não disponível";

/* Проверка ссылки на файл */
"file_link_checking" = "Verificando ...";

/* Default file name */
"file_name_unknown" = "Arquivo sem título";

"file_transfer_disabled" = "Transferência de arquivo desativada";

/* Формат для размера файла в байтах */
"format_file_size_b" = "%.0f B";

/* Формат для размера файла в килобайтах */
"format_file_size_kb" = "%.0f KB";

/* Формат для размера файла в мегабайтах */
"format_file_size_mb" = "%.2f MB";

/* Подсказка в окне ввода сообщения */
"input_message_placeholder" = "Digite sua mensagem...";

"jivo_business_messenger" = "Chat desenvolvido por";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку открывает системный пикер документов. */
"media_upload_attachment_type_selecting_document" = "Documento";

/* Надпись на кнопке контекстного меню выбора типа вложения. Нажатие на кнопку вызывает пикер фотогалереи. */
"media_upload_attachment_type_selecting_photo" = "Foto";

/* Заголовок с вопросом о том, какой тип вложения пользователь хочет прикрепить к сообщению. */
"media_upload_select_an_attachment_type_title" = "O que você gostaria de anexar?";

/* Системное сообщение в ленте чата, говорящее о том, что в данный момент ведётся загрузка файла на сервер. */
"media_upload_sending_the_file" = "Enviando arquivo";

"media_uploading_common_error" = "Falha no carregamento do arquivo";

/* Ошибка, возникающая при неудачной подготовке файла к загрузке. */
"media_uploading_extraction_error" = "Falha na leitura do arquivo";

/* Превышение лимита выгружаемого файла */
"media_uploading_too_large" = "Dosya boyutu limiti %dMB";

"Media.Access.Missing" = "Favor permitir acesso";

"Media.Access.Suggestion" = "O JivoChat necessita acesso à sua pasta de imagens para enviar fotos e vídeos.\n\nFavor ir até [Ajustes > App > Fotos] para permitir o acesso.";

"Media.Picker.Camera" = "Câmera";

/* Пункт меню "Копировать ссылку" */
"menu_action_copy" = "Link de cópia";

/* Пункт меню "Cкачать" */
"menu_action_download" = "Baixar";

/* Кнопка скачать для прикрепленного документа/файла */
"message_download" = "Baixar";

/* Системное сообщение о присоединении оператора к чату */
"message_system_operator_accepted" = "Operador entrou no chat";

/* Unsupported file type */
"message_unsupported_media" = "Este tipo de arquivo não é compatível";

"Message.Deleted" = "A mensagem foi excluída";

"Message.Edited" = "(editado)";

"Message.Preview.Line" = "O chat foi transferido para a linha secundária";

"Message.Sender.You" = "Você";

"notification_channel_message_description" = "Mensagem do Jivo SDK";

"notification_channel_message_name" = "Jivo";

/* Format for text message where $1 is agent name, $2 - text message */
"notification_message_text_format" = "%1$s: %2$s";

"notification_message_title" = "Apoio";

/* Пункт "Копировать" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_copy" = "Copiar";

/* Пункт "Повторить отправку" контекстного меню, вызываемого долгим тапом по бабблу сообщения. */
"options_resend" = "Reenviar";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway., If there is an error then the alert should be displayed on photo library access try when starting to pick images. */
"PhotoLibrary.Access.NoAvailableImages" = "Nenhuma imagem disponível";

/* Normally an alert with this message shouldn't be displayed but for test purposes it was added to SDK anyway */
"PhotoLibrary.Access.Unavailable" = "A biblioteca de fotos não está disponível";

"toast_copied_to_clipboard" = "Copiado";

/* Приветственное сообщение для пустого чата */
"welcome_message_placeholder" = "Converse com nossa equipe de atendimento e nos diga se encontrar qualquer erro para que possamos consertá-lo";

